Revit 2024 API
FBXExportOptions.LevelsOfDetailValue Property
The value of the levels of detail.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public int LevelsOfDetailValue { get; set; }
Visual Basic
Public Property LevelsOfDetailValue As Integer
	Get
	Set
Visual C++
public:
property int LevelsOfDetailValue {
	int get ();
	void set (int value);
}
Field Value
To use this option, UseLevelsOfDetail should be set to true. And the value should be in the range [0, 15]. It will be calculated based on the settings of current view if it's not assigned a valid value.
See Also
FBXExportOptions Class
Autodesk.Revit.DB Namespace